In [1]:
#Box for imports
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
lesson = pd.DataFrame({'key': ['courtney', 'courtney', 'courtney', 'courtney', 'courtney', 'ceci', 'ceci', 'ceci', 'ceci'],
             'value': ['a', 'a', 'b', 'c', 'd', 'a', 'a', 'b', 'b']})
lesson

        key value
0  courtney     a
1  courtney     a
2  courtney     b
3  courtney     c
4  courtney     d
5      ceci     a
6      ceci     a
7      ceci     b
8      ceci     b

In [3]:
dedup_total_data = lesson[['key', 'value']].drop_duplicates().sort_values(by='value')

In [4]:
dedup_key = lesson[['key']].drop_duplicates()

In [5]:
final_results = pd.DataFrame({})
for unique_key in dedup_key.key.tolist():
    filtered = dedup_total_data.loc[dedup_total_data['key']==unique_key]
    final_results = final_results.append({'key':unique_key,'value':filtered.value.tolist()}, ignore_index=True)
    print (unique_key)

courtney
ceci

In [6]:
filtered

    key value
5  ceci     a
7  ceci     b

In [7]:
final_results

        key         value
0  courtney  [a, b, c, d]
1      ceci        [a, b]

In [13]:
#loop through rows in final_results:
for index, row in final_results.iterrows(): #iterrows iterates through the rows of a DataFrame
    #print(row['key']) #we are telling python to print every cell in the key column by row
    print(row['value'])
    for char in row['value']:
        print(char)
        #break #this tells python to stop after the first iteration

['a', 'b', 'c', 'd']
a
b
c
d
['a', 'b']
a
b

In [17]:
exploded_df = pd.DataFrame({}) #initialize a place to hold our dataset
#loop through rows in final_results:
for index, row in final_results.iterrows(): #iterrows iterates through the rows of a DataFrame
    #print(row['key']) #we are telling python to print every cell in the key column by row
    print(row['value']) #print each cell in the row of the "value" column
    for char in row['value']: #for each character in the cell, print the character
        print(char)
        exploded_df = exploded_df.append({ #add that character to the empty list we created
            'key':row['key'],
            'value':char,
        }, ignore_index=True)

['a', 'b', 'c', 'd']
a
b
c
d
['a', 'b']
a
b

In [18]:
exploded_df #an exploded df contains one row for each key/value combo

        key value
0  courtney     a
1  courtney     b
2  courtney     c
3  courtney     d
4      ceci     a
5      ceci     b

In [20]:
final_results #a collapsed df contains one row for each unique key

        key         value
0  courtney  [a, b, c, d]
1      ceci        [a, b]

# Homework:
#Loop through lister
#Loop through each list
#print out the max value in the whole set
#print out the max value in each list
#create a new list with all values from all lists combined

In [ ]:
list1 = [20,30,40,50]
list2 = [10,11,7,-1,0]
list3 = [80,99,12, 13]
lister = [list1, list2, list3]

# Next lesson:
#Either filtering, more nested for loops, or classes